sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Tarea_3.c
/*
 * Tarea_3.c
 *
 *  Created on: Jul 3, 2026
 *      Author: Sophia Alejandra Velasquez Fuentes - sovelasquezf@unal.edu.co
 *      Brief: Contador con fotocompuertas
 *
 *  Distribución de los Timers - Pines
 *
 *  - TIM1 - AF01 (PWM)
 *  	CH2 -> PA9: Color verde
 *  	CH3 -> PA10: Color Rojo
 *  	CH4 -> PA11: Color Azul
 *
 *  - TIM2
 *    (Encoder - Verde) - AF01
 *  	CH1 -> PA0: DT
 *  	CH2 -> PA1: CLK
 *
 *    (Comunicación Serial - Rojo) - AF07
 *  	CH3 -> PA2: USART2_TX (Transmisión)
 *  	CH4 -> PA3: USART2_RX (Recepción)
 *
 *  - TIM3 - AF02 (Potenciómetro - Azul)
 *  	CH1 -> PA6: ADC1_6 (Conversión analogo-digital)
 *
 *  - TIM4 (Led OK)
 * 		PH1: Pin asociado a D2 en la board táctica
 *
 * 	- Extra - AF00:
 * 		PA8: MCO_1
 *
 */

#include <stm32f4xx_hal.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

TIM_HandleTypeDef htim1;			//TIM1 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

TIM_HandleTypeDef htim2;			//TIM2 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

TIM_HandleTypeDef htim3;			//TIM3 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

TIM_HandleTypeDef htim4;			//TIM4 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

ADC_HandleTypeDef hadc1 = {0};		//ADC1 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

UART_HandleTypeDef huart2 = {0};	//USART2 handle debe ser global para que stm32f4xx_it.c pueda acceder a el


/*Variables*/
uint8_t init_Msg[] =
"\r\n"
"Tarea 3 - Sophia Velasquez\r\n"
"--------------------------------------------------\r\n"
"Caracteres para la recepción:\r\n"
" '+': Incrementa el brillo en 1%\r\n"
" '-': Decrementa el brillo en 1%\r\n"
" '0': Lleva el valor a 0%\r\n"
" 'M': Lleva el valor al punto intermedio (50%)\r\n"
"--------------------------------------------------\r\n"
"\r\n";

volatile uint16_t pwm_rojo = 0;
volatile uint16_t pwm_verde = 0;
volatile uint16_t pwm_azul = 0;

volatile uint16_t actual_rojo = 0;
volatile uint16_t actual_verde = 0;
volatile uint16_t actual_azul = 0;

volatile uint16_t raw_adc = 0;
volatile uint16_t adc_done = 0;

volatile uint16_t raw_usart = 0;
volatile uint8_t usart_done = 0;
uint8_t rx_data = 0;
uint8_t msg_buffer[256];
float adc_value_mv = 0.0f;

volatile uint16_t raw_encoder = 0;
volatile uint16_t encoder_dir = 0;
char* dir_str = 0;



/*Implementación FSM*/
typedef enum{
	STATE_CHECK = 0,		//Verifica el cambio en algún periférico
	STATE_UPDATE_ADC,		//Estado de lectura analógica y actualización del azul
	STATE_UPDATE_ENCODER,	//
	STATE_UPDATE_USART,
	STATE_TRANSMIT_MSG
} FSM_STATE;

FSM_STATE estado_actual = STATE_CHECK;


/*Prototipo de funciones privadas*/
static void SystemClock_Config(void);
static void gpio_Init(void);
static void tim1_pwm_Init(void);
static void tim2_encoder_Init(void);
static void tim3_adc_Init(void);
static void tim4_led_ok_Init(void);
static void usart2_Init(void);
static void adc_Init(void);
static void mco1_Init(void);


int main(void){

	/*Inicialización de los bloques independientes*/
	HAL_Init();				//Inicializa HAL: SysTick, caché, agrupación de prioridades
	SystemClock_Config();	//Configura el árbol de relojes: HSI a 16 MHz
	gpio_Init();			//Configura PH1 (Led en la tarjeta nucleo)
	tim4_led_ok_Init();		//Configura TIM4: evento de actualización cada 250 ms

	tim1_pwm_Init();		//Configura PWM a 2.5 kHz para el led RGB (PA9, PA10, PA11) con resolución de 400
	tim2_encoder_Init();	//Configura TIM2 en modo Encoder (PA0, PA1)
	tim3_adc_Init();		//Configura TIM3 para el disparo del ADC (PA6) usando el TGRO (Trigger automático a 20ms)
	usart2_Init();			//Configura USART2 a 19200 bps (8N1) en modo asíncrono (UART) para transmisión y recepción
	adc_Init();				//Configura PA6 para ADC de 12 bits sincronizado con TIM3
	mco1_Init();			//Habilita el pin PA8 para monitorear el reloj HSI en osciloscopio

	/*Recepción del mensaje inicial (Instrucción con los caracteres específicos a usar)*/
	HAL_UART_Transmit(&huart2, (uint8_t *) init_Msg, strlen((char *) init_Msg), 200);

	/*Inicializa todos los canales en 0%*/
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 0);
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, 0);
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, 0);

	while(1){

		switch(estado_actual){

		case STATE_CHECK:

			if(usart_done){

				estado_actual = STATE_UPDATE_USART;

			}

			else if((__HAL_TIM_GET_COUNTER(&htim2) / 4) != actual_verde){

				estado_actual = STATE_UPDATE_ENCODER;

			}

			else if(adc_done == 1){

				uint16_t temp_azul = (raw_adc * 400) / 4095;		//Lectura temporal del PWM azul

				if(abs((int)temp_azul - (int)actual_azul) > 4){		//Se verifica que si haya una diferencia mayor al 1% (4 unidades)

					estado_actual = STATE_UPDATE_ADC;

				}

				else{

					adc_done = 0;	//Si la diferencia no se cumple se toma como ruido y se limpia la bandera

				}

			}

			break;

		case STATE_UPDATE_ADC:

			pwm_azul = (raw_adc * 400) / 4095;							//Se hace la conversión del raw_adc

			__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, pwm_azul);		//Se carga el valor del CCR al PWM del canal 4

			actual_azul = pwm_azul;										//Se sobreescribe el valor para la próxima comparación

			estado_actual = STATE_TRANSMIT_MSG;

			adc_done = 0;												//Se baja la bandera

			break;

		case STATE_UPDATE_ENCODER:

			raw_encoder = __HAL_TIM_GET_COUNTER(&htim2) / 4;

			actual_verde = raw_encoder;

			pwm_verde = raw_encoder * 4;

			__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, pwm_verde);

			estado_actual = STATE_TRANSMIT_MSG;

			break;

		case STATE_UPDATE_USART:

			raw_usart = pwm_rojo / 4;

			if(rx_data == '+'){
				if(raw_usart < 100){

					raw_usart++;

				}

			}

			else if(rx_data == '-'){
				if(raw_usart > 0){

					raw_usart--;

				}

			}

			else if(rx_data == '0'){

				raw_usart = 0;

			}

			else if(rx_data == 'M'){

				raw_usart = 50;

			}

			pwm_rojo = raw_usart * 4;

			actual_rojo = pwm_rojo;

			__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, pwm_rojo);


