sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Tarea_3.c
			HAL_UART_Receive_IT(&huart2, &rx_data, 1);


			usart_done = 0;

			estado_actual = STATE_TRANSMIT_MSG;

			break;

		case STATE_TRANSMIT_MSG:

			adc_value_mv = (float)((3300.0f / 4095.0f) * raw_adc);

			encoder_dir = __HAL_TIM_IS_TIM_COUNTING_DOWN(&htim2);

			if(encoder_dir == 1){

				dir_str = "CCW";

			}

			else if(encoder_dir == 0){

				dir_str = "CW";

			}


			uint16_t clicks_rojo = pwm_rojo / 4;

			uint16_t pasos_encoder = __HAL_TIM_GET_COUNTER(&htim2) / 4;

			sprintf((char *)msg_buffer,
			"--------------------------------------------------\r\n"
			"ADC value = %u raw\r\n"
			"ADC value = %.0f mV\r\n"
			"Encoder dir: %s, value = %d\r\n"
			"UART value = %u clicks\r\n"
			"--------------------------------------------------\r\n"
			"\r\n",raw_adc, adc_value_mv, dir_str, pasos_encoder, clicks_rojo);

			HAL_UART_Transmit(&huart2, msg_buffer, strlen((char *)msg_buffer), 200);

			estado_actual = STATE_CHECK;


			break;

		default:

			estado_actual = STATE_CHECK;

			break;

		}

	}

}


/*Funciones privadas*/

/*
 * SystemClock_Config
 * Usa el oscilador interno HSI a 16 MHz
 * Sin PLL — configuración de reloj más simple posible
 */
static void SystemClock_Config(void){

	/*Inicialización de estructuras*/
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /*HSI ya está encendido al resetear (Confirmar y usarlo)*/
    RCC_OscInitStruct.OscillatorType      = RCC_OSCILLATORTYPE_HSI;			//Oscilador Interno de Alta Velocidad (HSI)
    RCC_OscInitStruct.HSIState            = RCC_HSI_ON;						//Encendido del HSI
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;		//Calibración por defecto de fábrica para el HSI
    RCC_OscInitStruct.PLL.PLLState        = RCC_PLL_NONE;					//Desactivación del PLL para trabajar a 16 MHz

    /*Cargando la configuración en los registros FSR del MCU*/
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    /*Seleccionar HSI como SYSCLK (Todos los divisores de bus en 1)*/
    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_SYSCLK |	//Configuración simultánea de los relojes
                                       RCC_CLOCKTYPE_HCLK   |
                                       RCC_CLOCKTYPE_PCLK1  |
                                       RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_HSI;	//Reloj del sistema (SYSCLK) = 16 MHz
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;   		//Divisor del AHB (HCLK) en 1 = 16 MHz
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;     		//Divisor del APB1 (PCLK1) en 1 = 16 MHz
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;     		//Divisor del APB2 (PCLK2) en 1 = 16 MHz

    /*FLASH_LATENCY_0 = cero wait states, correcto para 16 MHz*/
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0);

}


/*
 * gpio_Init
 * Configura PH1 como salida push-pull (Led D2 de la tarjeta nucleo)
 */
static void gpio_Init(void){

	/*Inicialización de estructuras*/
    GPIO_InitTypeDef GPIO_InitStruct = {0};

	/*Habilitar reloj de GPIOH en el bus AHB1*/
	__HAL_RCC_GPIOH_CLK_ENABLE();

    /*Configuración PH1*/
    GPIO_InitStruct.Pin   = GPIO_PIN_1;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;		//Establece el pin en modo salida Push-Pull
    GPIO_InitStruct.Pull  = GPIO_NOPULL;				//Desactiva resistencias de Pull-Up o Pull-Down
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;		//Configuración de velocidad como baja

    /*Cargando la configuración en los registros FSR del MCU*/
    HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

}


/*
 * tim1_pwm_Init
 * Configura el TIM1 en modo PWM para controlar los canales 2, 3 y 4
 * Frecuencia 2.5 kHz
 */
static void tim1_pwm_Init(void){

	/*Configuración de pines*/
	/*Inicialización de estructuras*/
	GPIO_InitTypeDef GPIO_Init_pwm = {0};

	/*Habilitar reloj de GPIOA en el bus AHB1*/
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configuración general de los pines: PA9, PA10, PA11*/
	GPIO_Init_pwm.Pin		= GPIO_PIN_9  |
							  GPIO_PIN_10 |
							  GPIO_PIN_11;
	GPIO_Init_pwm.Mode		= GPIO_MODE_AF_PP;			//Establece los pines en modo función alternativa
	GPIO_Init_pwm.Pull		= GPIO_NOPULL;				//Desactiva resistencias de Pull-Up o Pull-Down
	GPIO_Init_pwm.Speed		= GPIO_SPEED_FREQ_HIGH;		//Configuración de velocidad como alta
	GPIO_Init_pwm.Alternate = GPIO_AF1_TIM1;			//Función alernativa correspondiente a AF1 en TIM1

	/*Cargar la configuracion en los registros FSR del MCU */
	HAL_GPIO_Init(GPIOA, &GPIO_Init_pwm);

	/*Configuración del TIM1*/
	/*Habilitar reloj de TIM1 en el bus APB2*/
	__HAL_RCC_TIM1_CLK_ENABLE();

	/*Configuración general del TIM1*/
	htim1.Instance				 = TIM1;
	htim1.Init.Prescaler		 = 16 - 1;								//Configurando el Prescaler a 1 us (16 MHz / 16 = 1 MHz)
	htim1.Init.CounterMode		 = TIM_COUNTERMODE_UP;					//Conteo ascendente
	htim1.Init.Period 			 = 400 - 1;								//Periodo de 1 us * 400 = 400 us (2.5 kHz)
	htim1.Init.ClockDivision 	 = TIM_CLOCKDIVISION_DIV1;				//División en 1 = 2.5 kHz
	htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;		//Habilita la precarga automática

	/*Cargar la configuracion en los registros FSR del MCU */
	HAL_TIM_PWM_Init(&htim1);

	/*Configuración de canales del TIM1: CH2, CH3 y CH4*/
	/*Inicialización de estructuras*/
	TIM_OC_InitTypeDef ConfigOC =  {0};

	/*Configuración general de los canales*/
	ConfigOC.OCMode 	= TIM_OCMODE_PWM1;			//Establece el modo PWM1 (Salida en alto mientras CNT < CCR)
	ConfigOC.Pulse 		= 0;						//Inicializa el CCR en 0%
	ConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;		//Configura polaridad alta (En alto hay un 1 lógico)
	ConfigOC.OCFastMode = TIM_OCFAST_DISABLE;		//Evita fallos en el ciclo de trabajo (Sólo cambiará su estado después de una comparación válida entre el CNT y CCR)

	/*Cargar la configuracion en los registros FSR del MCU (Para cada canal) */
	HAL_TIM_PWM_ConfigChannel(&htim1, &ConfigOC, TIM_CHANNEL_2);
	HAL_TIM_PWM_ConfigChannel(&htim1, &ConfigOC, TIM_CHANNEL_3);
	HAL_TIM_PWM_ConfigChannel(&htim1, &ConfigOC, TIM_CHANNEL_4);

	/*Inicialiación de cada canal */
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);

